cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Java is a requirement for android-sdk
cask "java"

brew "ant"
brew "android-sdk"
brew "antigen"
brew "bash"
brew "python"
brew "certbot"
brew "cmake"
brew "direnv"
brew "flyway"
brew "git"
brew "gradle"
brew "jenv"
brew "mas"
brew "maven"
brew "node"
brew "python@2"
brew "opencv", link: false
brew "pgcli"
brew "rabbitmq", link: false
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "scrcpy"
brew "sshfs"
brew "typescript"
brew "webp"
brew "yarn"

cask "android-studio"
cask "android-platform-tools"
cask "google-chrome"
cask "google-drive-file-stream"
cask "handbrake"
cask "intellij-idea-ce"
cask "iterm2"
cask "itsycal"
cask "osxfuse"
cask "postman"
cask "slack"
cask "spectacle"
cask "spotify"
cask "spotmenu"
cask "typora"
cask "vagrant"
cask "virtualbox"

mas "1Password", id: 443987910
mas "Boom 2", id: 948176063
